app/controllers/api/activities_controller.rb

		def index
			begin
		  	  render json: Activity.select(:id, :name, :description).order(sort_by + ' ' + order).to_json, status: :ok
---
SELECT `activities`.`id`, `activities`.`name`, `activities`.`description` FROM `activities`  ORDER BY description desc

		def create
			begin
			  activity = Activity.new(activity_params)
			  if activity.save
---
INSERT INTO `activities` (`name`, `description`, `created_at`, `updated_at`) VALUES ('Nueva Actividad', 'Descripción', '2017-04-29 22:03:10', '2017-04-29 22:03:10')

		def update
			begin
			  	if !@activity.nil?
			      if @activity.update(activity_params)
---
UPDATE `activities` SET `description` = 'Esta es una muy buena descripción2', `updated_at` = '2017-05-02 22:18:22' WHERE `activities`.`id` = 18

		def destroy
			begin
			  if !@activity.nil?
			    @activity.destroy
---
DELETE FROM `activities` WHERE `activities`.`id` = 11

		def set_activity
		  @activity = Activity.where(id: params[:id])
		  if !@activity.empty?
---
SELECT  `activities`.* FROM `activities` WHERE `activities`.`id` = 12 LIMIT 1
SELECT COUNT(*) FROM `activities` WHERE `activities`.`id` = 19
SELECT `activities`.* FROM `activities` WHERE (name LIKE '%10%' OR description LIKE '%10%')