app/controllers/api/activity_logs_controller.rb

		def index
		  	begin
		      activity_logs = ActivityLog.select(:id, :baby_id, :assistant_id, :activity_id, :start_time, :stop_time, :duration).order('start_time desc')
---
SELECT `activity_logs`.`id`, `activity_logs`.`baby_id`, `activity_logs`.`assistant_id`, `activity_logs`.`activity_id`, `activity_logs`.`start_time`, `activity_logs`.`stop_time`, `activity_logs`.`duration` FROM `activity_logs`  ORDER BY start_time desc

	    def search
	    	begin
		      activity_logs = ActivityLog.by_column_filter(params[:activity_log][:baby_id], params[:activity_log][:assistant_id]).order('start_time desc')

		      status = params[:activity_log][:status]
		      activity_logs = activity_logs.where(stop_time: nil) if status == "start"
		      activity_logs = activity_logs.where.not(stop_time: nil) if status == "stop"
---
SELECT `activity_logs`.* FROM `activity_logs` WHERE `activity_logs`.`baby_id` = 3 AND `activity_logs`.`assistant_id` = NULL  ORDER BY start_time desc
SELECT `activity_logs`.* FROM `activity_logs` WHERE `activity_logs`.`baby_id` = 2 AND `activity_logs`.`assistant_id` = 1 AND (`activity_logs`.`stop_time` IS NOT NULL)  ORDER BY start_time desc
SELECT `activity_logs`.* FROM `activity_logs` WHERE (baby_id = ? OR assistant_id = ? OR activity_id = ?,

		def create
			begin
			  if validate_datetime(params[:activity_log][:start_time])
				  activity_log = ActivityLog.new(activity_log_params)

				  if activity_log.save
				  	activity_logs = ActivityLog.where(id: activity_log.id)
---
INSERT INTO `activity_logs` (`baby_id`, `assistant_id`, `activity_id`, `start_time`, `comments`, `created_at`, `updated_at`) VALUES (2, 2, 2, '0022-12-12 00:00:00', 'BORRAME', '2017-04-30 17:18:31', '2017-04-30 17:18:31')
SELECT `activity_logs`.* FROM `activity_logs` WHERE `activity_logs`.`id` = 104

		def update
			begin
			    if !@activity_log.nil?

				  #Add current Time to stop_time
				  stop_time = Time.now

				  if stop_time > @activity_log.start_time

					  #Get Time of duration in minutes
					  minutes = ((stop_time - @activity_log.start_time)/60).round(1)
					  @activity_log.duration = minutes
					  @activity_log.stop_time = stop_time

				      if @activity_log.update(activity_log_params)
				        activity_logs = ActivityLog.where(id: @activity_log.id)
---
UPDATE `activity_logs` SET `duration` = 2, `stop_time` = '2017-05-01 03:05:56', `comments` = 'Dos minutos más', `updated_at` = '2017-05-01 03:05:56' WHERE `activity_logs`.`id` = 133
SELECT  `activity_logs`.* FROM `activity_logs` WHERE `activity_logs`.`id` = 111 LIMIT 1

		def destroy
			begin
			  if !@activity_log.nil?
		      	@activity_log.destroy
---
DELETE FROM `activity_logs` WHERE `activity_logs`.`id` = 111

		def set_activity_log
		  @activity_log = ActivityLog.where(id: params[:id])
		  if !@activity_log.empty?
---
SELECT  `activity_logs`.* FROM `activity_logs` WHERE `activity_logs`.`id` = 111 LIMIT 1
SELECT COUNT(*) FROM `activity_logs` WHERE `activity_logs`.`id` = 161
SELECT `activity_logs`.* FROM `activity_logs`  ORDER BY activity_id desc