app/controllers/api/assistants_controller.rb

		def index
			begin
		  	  render json: Assistant.select(:id, :name, :group, :address, :phone).order(sort_by + ' ' + order).to_json, status: :ok
---
SELECT `assistants`.`id`, `assistants`.`name`, `assistants`.`group`, `assistants`.`address`, `assistants`.`phone` FROM `assistants`  ORDER BY address desc

	    def search
	    	begin
			  query = params[:query]
			  puts "activities @"
			  activities = Assistant.where('name LIKE ? OR address LIKE ? OR phone LIKE ?',
			                       "%#{query}%", "%#{query}%", "%#{query}%")
---
SELECT `assistants`.* FROM `assistants` WHERE (name LIKE '%Idona %' OR group LIKE '%Idona %' OR address LIKE '%Idona %' OR phone LIKE '%Idona %')

		def create
			begin
			  assistant = Assistant.new(assistant_params)
			  if assistant.save
---
INSERT INTO `assistants` (`name`, `group`, `address`, `phone`, `created_at`, `updated_at`) VALUES ('Nueva cuidadora', '2', 'la que sea', 'cualquiera', '2017-05-02 21:52:09', '2017-05-02 21:52:09')

		def update
			begin
			  	if !@assistant.nil?
			      if @assistant.update(assistant_params)
---
UPDATE `assistants` SET `name` = 'Nueva cuidadora22', `group` = '33', `address` = 'wherever', `phone` = 'cualquierasa', `updated_at` = '2017-05-02 21:53:02' WHERE `assistants`.`id` = 11

		def destroy
			begin
			  if !@assistant.nil?
			    @assistant.destroy
---
DELETE FROM `assistants` WHERE `assistants`.`id` = 11

		def set_assistant
		  @assistant = Assistant.where(id: params[:id])
		  if !@assistant.empty?
---
SELECT `assistants`.* FROM `assistants` WHERE `assistants`.`id` = 11
SELECT COUNT(*) FROM `assistants` WHERE `assistants`.`id` = 11