app/controllers/api/babies_controller.rb

SELECT `babies`.`id`, `babies`.`name`, `babies`.`birthday`, `babies`.`mother_name`, `babies`.`father_name`, `babies`.`address`, `babies`.`phone` FROM `babies`  ORDER BY mother_name desc
---
		def index
			begin
		  	  babies = Baby.select(:id, :name, :birthday, :mother_name, :father_name, :address, :phone).order(sort_by + ' ' + order)

SELECT `activity_logs`.`id`, `activity_logs`.`baby_id`, `activity_logs`.`assistant_id`, `activity_logs`.`start_time`, `activity_logs`.`stop_time` FROM `activity_logs` WHERE `activity_logs`.`baby_id` = 3
---
		def activities
			begin
				if !@baby.nil?

					activity_logs = @baby.activity_logs.select(:id, :baby_id, :assistant_id, :start_time, :stop_time)

INSERT INTO `babies` (`name`, `birthday`, `mother_name`, `father_name`, `address`, `phone`, `created_at`, `updated_at`) VALUES ('Bebe', '2015-03-11', 'Marlen', 'Marleno', 'Nose', '8732623', '2017-04-30 05:52:48', '2017-04-30 05:52:48')
---
		def create
			begin
			  if validate_date(params[:baby][:birthday])
				    baby = Baby.new(baby_params)

				    #Validate birthday after today
				    today = DateTime.now.strftime("%Y-%m-%d")

				    if baby.birthday.strftime("%Y-%m-%d") < today

					  if baby.save

UPDATE `babies` SET `name` = 'Bebesito', `birthday` = '2015-03-11', `mother_name` = 'Merlen', `father_name` = 'David', `address` = 'nose', `updated_at` = '2017-04-30 05:51:51' WHERE `babies`.`id` = 101
---
		def update
			begin
				if validate_date(params[:baby][:birthday])

					#Validate birthday after today
				    today = DateTime.now.strftime("%Y-%m-%d")
				    birthday = Time.strptime(params[:baby][:birthday], "%Y-%m-%d")

					if birthday.strftime("%Y-%m-%d") < today
						if !@baby.nil?
					      if @baby.update(baby_params)

DELETE FROM `babies` WHERE `babies`.`id` = 101
---
		def destroy
			begin
			  if !@baby.nil?
			    @baby.destroy

SELECT  `babies`.* FROM `babies` WHERE `babies`.`id` = 101 LIMIT 1
SELECT COUNT(*) FROM `babies` WHERE `babies`.`id` = 200
SELECT `babies`.* FROM `babies` WHERE (name LIKE '%h%' OR birthday LIKE '%h%' OR mother_name LIKE '%h%' OR father_name LIKE '%h%' OR adress LIKE '%h%' OR phone LIKE '%h%')
---
		def set_baby
		  @baby = Baby.where(id: params[:id])
		  if !@baby.empty?