app/controllers/static_pages_controller.rb

SELECT COUNT(*) FROM `babies`
SELECT COUNT(*) FROM `activities`
SELECT COUNT(*) FROM `activity_logs`
SELECT COUNT(*) FROM `assistants`
---
  def landing_page
  	@babies        = Baby.count
  	@activities    = Activity.count
  	@activity_logs = ActivityLog.count
  	@assistants    = Assistant.count